Revit 2024 API
ParameterTypeId.RebarHookLengthOverride Property
 "Override Hook Lengths"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarHookLengthOverride { get; }
Visual Basic
Public Shared ReadOnly Property RebarHookLengthOverride As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarHookLengthOverride {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace